Pandas常用的数据类型

Series 一维, 带标签数组

DataFrame 二维, Series容器

In [1]:
import pandas as pd

print(pd.Series([1, 2, 13, 3, 4]))

0     1
1     2
2    13
3     3
4     4
dtype: int64

In [2]:
import pandas as pd

t2 = pd.Series([1, 23, 2, 2, 1], index=list('abcde'))
print(t2)
print(t2.astype(float))

a     1
b    23
c     2
d     2
e     1
dtype: int64
a     1.0
b    23.0
c     2.0
d     2.0
e     1.0
dtype: float64

In [4]:
import pandas as pd
import string

# temp_dict = {'name': 'A', 'age': 200, 'tel': 1000, 'IQ': 100, 'EQ': 100}
temp_dict = {'name': 'A', 'age': 200, 'tel': 1000, 'IQ': 100, 'EQ': 100}
t3 = pd.Series(temp_dict)
print(t3)
#---
# a = {string.ascii_uppercase[i] : i for i in range(10)}
# print(pd.Series(a, index=list(string.ascii_uppercase[5 : 15])))
# print(t3['age'])

name       A
age      200
tel     1000
IQ       100
EQ       100
dtype: object

Pandas的切片和索引

In [2]:
print(t3['age'], t3['tel'])

200 1000

In [4]:
# print(t3[:2])
print(t3[['age', 'tel']])

age     200
tel    1000
dtype: object

In [4]:
import pandas as pd
#布尔索引
t = pd.Series([1, 2, 4, 5, 10])
# print(t[t > 3])
# print(t)
t

0     1
1     2
2     4
3     5
4    10
dtype: int64

显示属性

In [2]:
print(t.index)
print('---')
for i in t.index:
    print(i)
print('---')
print(len(t.index))

RangeIndex(start=0, stop=5, step=1)
---
0
1
2
3
4
---
5

In [ ]:
print(list(t.index))
print(list(t.index)[0 : 4])

In [25]:
t.values

array([ 1,  2,  4,  5, 10], dtype=int64)

In [10]:
s = pd.Series(range(5))
# print(s)
# s.where(s > 0)
# s.mask(s > 0)
s.where(s > 1, 10)

0    10
1    10
2     2
3     3
4     4
dtype: int64

DataFrame

In [ ]:
import pandas as pd
import numpy as np

pd.DataFrame(np.arange(12).reshape(3, 4))

### DataFrame对象既有行索引又有列索引 <br>
### 行索引, 表明不同行， 横向索引, 叫index， 0轴, axis = 0 <br>
### 列索引, 表明不同列， 纵向索引, 叫column， 1轴, axis = 1

In [ ]:
pd.DataFrame(np.arange(20).reshape(5, 4), index=list('abcde'), columns=list('wxyz'))

In [7]:
import pandas as pd

d1 = {'name': ['A', 'B'], 'age': [20, 32], 'tel': [123, 456]}
df = pd.DataFrame(d1)
# df.shape
df.dtypes

name    object
age      int64
tel      int64
dtype: object

DataFrame的基础属性<br>
df.shape       行数 列数<br>
df.dtypes      列数据类型<br>
df.ndim        数据维度<br>
df.index       行索引<br>
df.columns     列索引<br>
df.valus       对象值<br>
DataFrame整体情况查询
df.head(3)     显示头部几行 默认5行
df.tail(3)     显示末尾几行 默认5行
df.info()      行列, 列索引, 列非空值个数, 列类型, 内存
df.describe()  计数, 均值, 标准差, 最大值, 四分位数, 最小值

In [7]:
import pandas as pd

df = pd.read_csv('../csv/dogNames2.csv')
df = df.sort_values(by='Count_AnimalName', ascending=True)
# print(df)
# print(df[:20])
print(df[:20]['Count_AnimalName'])

0       1
9383    1
9384    1
9386    1
9389    1
9390    1
9391    1
9392    1
9393    1
9394    1
9396    1
9397    1
9398    1
9400    1
9401    1
9402    1
9406    1
9407    1
9408    1
9409    1
Name: Count_AnimalName, dtype: int64

In [10]:
import pandas as pd
import numpy as np

t3 = pd.DataFrame(np.arange(12).reshape(3, 4)\
    , index = list("abc"), columns=list('wxyz'))
# print(t3)
t3
# print('---')
# print(t3.loc['a', 'w'])

   w  x   y   z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [11]:
t3.loc[['a', 'c']]

   w  x   y   z
a  0  1   2   3
c  8  9  10  11

In [15]:
import pandas as pd
import numpy as np

t3 = pd.DataFrame(np.arange(12).reshape(3, 4)\
    , index = list("abc"), columns=list('wxyz'))
t3

   w  x   y   z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [16]:
import pandas as pd
import numpy as np

t3 = pd.DataFrame(np.arange(12).reshape(3, 4), index=list("abc"), columns=list("wxyz"))
t3.loc[:, ['w', 'z']]

   w   z
a  0   3
b  4   7
c  8  11

In [17]:
t3.loc[['a', 'b'], ['w', 'z']]

   w  z
a  0  3
b  4  7

In [18]:
t3.loc['a' : 'c', ['w', 'z']]

   w   z
a  0   3
b  4   7
c  8  11

In [33]:
# print(t3)
t3
# print(t3.iloc[1:3, :2])
# print(t3.iloc[:, 'w'])

   w  x   y   z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [35]:
t3.iloc[:, 2]

a     2
b     6
c    10
Name: y, dtype: int64

In [36]:
t3.iloc[[0, 2], [2, 1]]

    y  x
a   2  1
c  10  9

In [45]:
t3.iloc[1 : , : 2]

   w  x
b  4  5
c  8  9

In [ ]:
t3.iloc[1 : , : 2] = 30
t3

布尔索引
& AND 
| OR

In [ ]:
import pandas as pd

df = pd.read_csv('./dogNames2.csv')
df[df['Count_AnimalName'] > 800]

In [ ]:
df[(800 < df["Count_AnimalName"]) & (df["Count_AnimalName"] < 1000)]

In [13]:
df = pd.Series({"info": "Fuck/you/sda/asdasdd", "Information": "Fuck/your/everyday"})
# df.str.split('/')
df.str.split('/')['Information']

for i in df.str.split('/')['Information']:
    print(i)

Fuck
your
everyday

In [2]:
import pandas as pd

df = pd.DataFrame({'info': ['ab, cd, ef', 'ff, dd, qq', 'ef, as, nm'], 'haha': [False, '33', '44']})
# df['info'].str.split(', ')
df

         info   haha
0  ab, cd, ef  False
1  ff, dd, qq     33
2  ef, as, nm     44

缺失数据的处理
判断数据是否为NaN 
```
pd.isnull(df), pd.notnull(df)
```
处理方法
方法一: 
```
dropna(axis=0, how='any', inplace=False)
```
方法二: 填充数据 
```
t.fillna(t.mean()), t.fiallna(t.median()) t.fillna(0)
```

In [ ]:
# pd.isnull(df)
pd.isnull(df['info'])

其他方法

In [4]:
import pandas as pd
import numpy as np

df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [5]:
df.fillna(100)

       A      B      C      D
0  100.0    2.0  100.0    0.0
1    3.0    4.0  100.0    1.0
2  100.0  100.0  100.0  100.0
3  100.0    3.0  100.0    4.0

See: https://pandas.pydata.org/docs/reference/api/pandas.Series.fillna.html?highlight=fillna#pandas.Series.fillna

Other Method that we can use
mean()
man()

In [43]:
import pandas as pd
import numpy as np

company = ['A', 'B', 'C']
comments = ['daskjd', 'jtretj', 'fdgkjl', '349', 'rior']

data = pd.DataFrame({
    'Company': [company[i] for i in np.random.randint(0, len(company), 10)],
    'Salary': np.random.randint(5, 50, 10),
    'Age': np.random.randint(15, 50, 10),
    'Intro': [comments[i] for i in np.random.randint(0, len(comments), 10)]
})
data

  Company  Salary  Age   Intro
0       A      39   39  daskjd
1       C      24   40    rior
2       B      14   37     349
3       B       5   40  fdgkjl
4       B       8   23    rior
5       A      42   16  daskjd
6       A      33   42  jtretj
7       B      35   33  fdgkjl
8       C      47   33  jtretj
9       A      38   20    rior

In [59]:
group = data.groupby('Company')
group = group.sum()
# group = group.sort_values(['Salary'],\
                          ascending=False)
# group
# list(group)

         Salary  Age
Company
C            75  136
A            67  111
B            51   68

In [64]:
# group = group.sum()
group = group.sort_values(['Age']\
        , ascending=False)
group

         Salary  Age
Company
C            75  136
A            67  111
B            51   68

### a
### b
### c
## ascending = True:
### a < b < c
## ascending = False:
### a > b > c

## sum()函数要groupby使用
## sum()返回的值为DataFrame或者Series

In [66]:
import pandas as pd
import numpy as np

company = ['A', 'B', 'C']

data = pd.DataFrame({
    'Company': [company[i] for i in np.random.randint(0, len(company), 10)],
    'Salary': np.random.randint(5, 50, 10),
    'Age': np.random.randint(15, 50, 10)
})

group = data.groupby('Company')
# print(group)
for item in group:
    #print(item)
    for i in item:
        print(i)
# group.mean()
group.min()

A
  Company  Salary  Age
4       A       6   30
9       A      10   23
B
  Company  Salary  Age
0       B      18   24
2       B      33   43
3       B       6   46
8       B      30   16
C
  Company  Salary  Age
1       C      25   18
5       C      44   36
6       C      36   30
7       C       5   27

         Salary  Age
Company
A             6   23
B             6   16
C             5   18